Revit.GeometryConversion.UnitConverter.InDynamoUnits``1(``0)
Convert from Revit API internal units (feet) to Revit Display units.
Can be used simply as geometry.InDynamoUnits() as the type is constrained
geometry:
Returns:

Revit.GeometryConversion.UnitConverter.InHostUnits``1(``0)
Convert from Revit Display Units to Revit API internal units (feet)
Can be used simply as geometry.InHostUnits()
geometry:
Returns:

Revit.GeometryConversion.UnitConverter.ConvertToDynamoUnits``1(``0@)
Convert the geometry to Dynamo units if convert is true.
The input geometry will be disposed and a converted geometry
will be assigned to it.
geometry:
Returns:

Revit.GeometryConversion.UnitConverter.ConvertToHostUnits``1(``0@)
Convert the geometry to host units if convert is true.
The input geometry will be disposed and a converted geometry
will be assigned to it.
geometry:
Returns: